app/controllers/features_controller.rb

SELECT * FROM `features` WHERE (`features`.`id` = 0)
---
  def show
    begin
      @feature = Feature.find(params[:id])

SELECT * FROM `features` WHERE (experiment_id = '1' and features.group like '%at1%')
DELETE FROM `features` WHERE `id` = 11
---
  def find_annotation
    flash[:error] = []
    @features = Feature.all()
    @features.delete_if { |x| x.group !~ /#{params[:search_string]}/ }