app/controllers/genomes_controller.rb

  def index #regular web request method
    @genomes = Genome.all
---
SELECT * FROM `genomes` LIMIT 1

  def show
    if Genome.exists?(params[:id])
     @genome = Genome.find(params[:id])
---
SELECT * FROM `genomes` WHERE (`genomes`.`id` = 1)